# print(5,6,7,8,9)

# n=5
# print(n)
# print(type(n))
# n = 'test'

# # print(n)
# n1 = "test2"

# a=5
# b=5.8
# c='hello'
# print(f"{a} - {b} - {c}")
# print("{} - {} - {}" .format(a,b,c)) # типы вывода

# print("введите первое число")
# a=input()
# b=input(" введите второе число") # число введется в этой же строке
# print(a)

# print(a, '+', b, '=', a+b) # результатом будет сложение строк, а не чисел - ab


# print("введите первое число")
# a=int(input())
# b=int(input(" введите второе число")) # число введется в этой же строке

# print(a, '+', b, '=', a+b) # теперь верно

a=4.5786
b=3.567123
print(a*b)
print(round(a*b, 3)) # округлит до третьего знака