# print(5,6,7,8,9)

# n=5
# print(n)
# print(type(n))
# n = 'test'

# # print(n)
# n1 = "test2"

# a=5
# b=5.8
# c='hello'
# print(f"{a} - {b} - {c}")
# print("{} - {} - {}" .format(a,b,c)) # типы вывода

# print("введите первое число")
# a=input()
# b=input(" введите второе число") # число введется в этой же строке
# print(a)

# print(a, '+', b, '=', a+b) # результатом будет сложение строк, а не чисел - ab


# print("введите первое число")
# a=int(input())
# b=int(input(" введите второе число")) # число введется в этой же строке

# print(a, '+', b, '=', a+b) # теперь верно


 #Найдите сумму цифр трехзначного числа n.
# Результат сохраните в перменную res.

a=4.5786
b=3.567123
print(a*b)
print(round(a*b, 3)) # округлит до третьего знака

 
res = 0
 
while n > 0:
    digit = n % 10
    res = res + digit
    n = n // 10
 
print("Сумма:", res)

# Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали n журавликов.
# Сколько журавликов сделал каждый ребенок, если известно, что Петя и Сережа сделали 
# одинаковое количество журавликов, а Катя сделала в два раза больше журавликов, 
# чем Петя и Сережа вместе?
# Выведите через пробел количество журавликов, сделанных Петей, Катей и Сережей.

